Tutorials/CsF_Solidification/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

massSource
{
    type            massSource;

    selectionMode   points;
    points          
    (
    (0.2 0.2 0.05)
    (0.5 0.2 0.05)
    (0.8 0.2 0.05)
    );

    phase           gas;
    rho             thermo:rho.gas;

    massFlowRate
    {
        type            scale;
        scale           squarePulse;
        start           0;
        duration        5;
        value           0.01;
    }

    fieldValues
    {
        U.gas       (0 0 0);
        T.gas       720;
    }
    
}


// ************************************************************************* //
