Tutorials/CsF_Solidification/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (gas liquid solid);

//referencePhase gas;


gas
{
    type            pureIsothermalPhaseModel;
    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }
    alphaMax        1;
    residualAlpha   1e-6;
}

liquid
{
    type            pureIsothermalPhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1e-3;
    }

    alphaMax        1;
    residualAlpha   1e-6;
}

solid
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               0.5e-4;
    }
    
    alphaMax        1;
    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.gas 0.7;
        minPartlyContinuousAlpha.gas 0.3;
        minFullyContinuousAlpha.liquid 0.7;
        minPartlyContinuousAlpha.liquid 0.3;
        minFullyContinuousAlpha.solid 0;
        minPartlyContinuousAlpha.solid 0;
    }
}

surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.07;
    }

    (gas and solid)
    {
        type            constant;
        sigma           0;
    }

    (solid and liquid)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
(
    (gas in liquid)
    {
        type            constant;
        E0              1.0;
    }

    (liquid in gas)
    {
        type            constant;
        E0              1.0;
    }

    (gas in solid)
    {
        type            constant;
        E0              1.0;
    }

    (solid in gas)
    {
        type            constant;
        E0              1.0;
    }

    (liquid in solid)
    {
        type            constant;
        E0              1.0;
    }

    (solid in liquid)
    {
        type            constant;
        E0              1.0;
    }
);

drag
(
    (gas in liquid)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (liquid in gas)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (solid in gas)
    {
        type            Ergun;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (solid in liquid)
    {
        type            Ergun;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (gas in liquid)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    (liquid in gas)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
();

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

interfaceCompression
();

// ************************************************************************* //
