Tutorials/CsF_Solidification/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue alpha.solid 0
);

regions
(

    boxToCell
    {
        box (0 0.5 -0.1) (1 1 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.gas 1
            volScalarFieldValue alpha.liquid 0
            volScalarFieldValue alpha.solid 0
        );
    }

    boxToCell
    {
        box (0 0 -0.1) (1 0.5 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.gas 0
            volScalarFieldValue alpha.liquid 1
            volScalarFieldValue alpha.solid 0
        );
    }



);



// ************************************************************************* //
